In [1]:
import numpy as np
import pandas as pd

In [2]:
train_df=pd.read_csv('train.csv')
test_df=pd.read_csv('test.csv')

In [3]:
train_df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
test_df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [12]:
frames=[train_df,test_df]
data=pd.concat(frames,sort=False)
data.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,7.836670e+05,783667.000000,783667.000000,783667.000000,537685.000000,237858.000000,550068.000000
mean,1.003029e+06,8.079300,0.409777,5.366196,9.844506,12.668605,9263.968713
std,1.727267e+03,6.522206,0.491793,3.878160,5.089093,4.125510,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001519e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003075e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [18]:
data.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2                 0
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [10]:
train_df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [17]:
data['Product_Category_2']

0          9.844506
1          6.000000
2          9.844506
3         14.000000
4          9.844506
            ...
233594     9.844506
233595     8.000000
233596     5.000000
233597    16.000000
233598     5.000000
Name: Product_Category_2, Length: 783667, dtype: float64

In [16]:
data.Product_Category_2.fillna(data.Product_Category_2.mode(),inplace=True)

In [20]:
data_cleaned=data.drop('Product_Category_3',axis=1)

In [25]:
data_cleaned.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Purchase
count,7.836670e+05,783667.000000,783667.000000,783667.000000,783667.000000,550068.000000
mean,1.003029e+06,8.079300,0.409777,5.366196,9.844506,9263.968713
std,1.727267e+03,6.522206,0.491793,3.878160,4.215396,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,12.000000
25%,1.001519e+06,2.000000,0.000000,1.000000,8.000000,5823.000000
50%,1.003075e+06,7.000000,0.000000,5.000000,9.844506,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,14.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,23961.000000

In [27]:
import category_encoders as ce

In [29]:
OHE = ce.OneHotEncoder(cols=['Gender',
                            'City_Category'],use_cat_names=True)
# encode the categorical variables
data_cleaned = OHE.fit_transform(data_cleaned)

In [30]:
data_cleaned.describe()

,User_ID,Gender_F,Gender_M,Occupation,City_Category_A,City_Category_C,City_Category_B,Marital_Status,Product_Category_1,Product_Category_2,Purchase
count,7.836670e+05,783667.00000,783667.00000,783667.000000,783667.000000,783667.000000,783667.000000,783667.000000,783667.000000,783667.000000,550068.000000
mean,1.003029e+06,0.24709,0.75291,8.079300,0.268282,0.310954,0.420764,0.409777,5.366196,9.844506,9263.968713
std,1.727267e+03,0.43132,0.43132,6.522206,0.443066,0.462884,0.493682,0.491793,3.878160,4.215396,5023.065394
min,1.000001e+06,0.00000,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,2.000000,12.000000
25%,1.001519e+06,0.00000,1.00000,2.000000,0.000000,0.000000,0.000000,0.000000,1.000000,8.000000,5823.000000
50%,1.003075e+06,0.00000,1.00000,7.000000,0.000000,0.000000,0.000000,0.000000,5.000000,9.844506,8047.000000
75%,1.004478e+06,0.00000,1.00000,14.000000,1.000000,1.000000,1.000000,1.000000,8.000000,14.000000,12054.000000
max,1.006040e+06,1.00000,1.00000,20.000000,1.000000,1.000000,1.000000,1.000000,20.000000,18.000000,23961.000000